<?php
    //性別の配列
    $sex = array(
        '1' => '男性',
        '2' => '女性'
    );
    //年齢の配列
    $age = array(
        '' => '未選択',
        '1' => '10代',
        '2' => '20代',
        '3' => '30代',
        '4' => '40代',
        '5' => '50代',
        '6' => '60代',
        '7' => '65歳以上'
    );
    //血液型の配列
    $blood_type = array(
        '1' => 'A型',
        '2' => 'B型',
        '3' => 'O型',
        '4' => 'AB型'
    );
    //職業の配列
    $job = array(
        '' => '未選択',
        '1' => '会社員',
        '2' => '公務員',
        '3' => '自営業',
        '4' => 'フリーター',
        '5' => '主婦',
        '6' => '学生',
        '7' => 'その他'
    );
    //都道府県の配列
    $prefecture = array(
        ''  => '未選択',
        '1'  => '北海道',
        '2'  => '青森県',
        '3'  => '岩手県',
        '4'  => '宮城県',
        '5'  => '秋田県',
        '6'  => '山形県',
        '7'  => '福島県',
        '8'  => '茨城県',
        '9'  => '栃木県',
        '10' => '群馬県',
        '11' => '埼玉県',
        '12' => '千葉県',
        '13' => '東京都',
        '14' => '神奈川県',
        '15' => '新潟県',
        '16' => '富山県',
        '17' => '石川県',
        '18' => '福井県',
        '19' => '山梨県',
        '20' => '長野県',
        '21' => '岐阜県',
        '22' => '静岡県',
        '23' => '愛知県',
        '24' => '三重県',
        '25' => '滋賀県',
        '26' => '京都府',
        '27' => '大阪府',
        '28' => '兵庫県',
        '29' => '奈良県',
        '30' => '和歌山県',
        '31' => '鳥取県',
        '32' => '島根県',
        '33' => '岡山県',
        '34' => '広島県',
        '35' => '山口県',
        '36' => '徳島県',
        '37' => '香川県',
        '38' => '愛媛県',
        '39' => '高知県',
        '40' => '福岡県',
        '41' => '佐賀県',
        '42' => '長崎県',
        '43' => '熊本県',
        '44' => '大分県',
        '45' => '宮崎県',
        '46' => '鹿児島県',
        '47' => '沖縄県'
    );
    //興味あるカテゴリーの配列
    $category = array(
        '1' => '音楽',
        '2' => '読書',
        '3' => '映画',
        '4' => 'ファッション',
        '5' => 'グルメ',
        '6' => 'インテリア',
        '7' => '旅行',
        '8' => 'その他'
    );
    //入力項目のキーの配列
    $default_key = array(
        '0'  => 'full_name',
        '1'  => 'kana',
        '2'  => 'sex',
        '3'  => 'age',
        '4'  => 'blood_type',
        '5'  => 'job',
        '6'  => 'prefecture',
        '7'  => 'post_code_1',
        '8'  => 'post_code_2',
        '9'  => 'address',
        '10' => 'address_other',
        '11' => 'phone_number_1',
        '12' => 'phone_number_2',
        '13' => 'phone_number_3',
        '14' => 'mail',
        '15' => 'mail_confirm',
        '16' => 'interest_category',
        '17' => 'contact_content'
    );